{
    "common": {
        "about": "About",
        "home": "Home",
        "product": "Product",
        "job": "Join us",
        "language": "Language",
        "successfulCase": "SuccessfulCase",
        "zh": "CN",
        "en": "EN",
        "navigation": "Navigation",
        "contactUs": "Contact us",
        "followUs": "Follow us",
        "tikTok": "Tik Tok",
        "tel": "Tel",
        "email": "Email",
        "address": "Address",
        "addressValue": "C4002，307 Guangzhou Ave.,R&F Newworkd Center",
        "weibo": "Weibo",
        "linkedin": "LinkedIn",
        "contact": "Contact us"

    },
    "index": {
        "bannerTitle": "Enable global C2B transition",
        "bannerTitleEn": "",
        "titleCh1": "Products & Services",
        "titleEn1": "",
        "productsExplain1": "Omni-Channel  Integrate resources, Improving customer experience",
        "productsExplain2": "Intelligent Manufacture   Visualized management, Quick reponding",
        "productsExplain3": "Brand management Production-marketing oordiation, Reducing inventory risks",
        "productsExplain4-1": "Collaborative Agents for Business Automation",
        "productsExplain4-2": "",
        "productsExplain4-3": "Unmanned management, Reducing costs",
        "titleCh2": "Why choose us",
        "titleEn2": "",
        "chooseTitle1": "Value-oriented service concept",
        "chooseExplain1-1": "Value-oriented solution",
        "chooseExplain1-2": "Focus on solution implementation",
        "chooseExplain1-3": "Long-term partnership",
        "chooseTitle2": "The best choice for top brands",
        "chooseExplain2-1": "Men：Saint Angelo, Joeone",
        "chooseExplain2-2": "Women：Yinger, Eeka",
        "chooseExplain2-3": "Others：Li-ning, Keers",
        "chooseTitle3": "Solid professional skills",
        "chooseExplain3-1": "China, USA and other transnational business",
        "chooseExplain3-2": "ERP，hybris consulting implementation ability",
        "chooseExplain3-3": "Advanced supply chain technology",
        "titleCh3": "Business Partner",
        "titleEn3": "",
        "partnerTitle1": "Klotho",
        "partnerExplain1": "Klotho：Global Internet customized supply chain",
        "partnerTitle2": "Saint Regent",
        "partnerExplain2": "Saint Regent：Cloud-ERP",
        "partnerTitle3": "Dingcast",
        "partnerExplain3": "Dingcast：Unmanned handling solution"
    },
    "about": {
        "bannerTitle": "Enable global C2B transition",
        "bannerExplain1": "Dingjust devotes to enable global C2B transition，is a full range of intelligent manufacturing solutions provider in fashion industry. Dingjust integrates solutions in Omni-channel, PLM, MES, and ERP, enables enterprises to face consumer needs directly, and eventually transfers business opportunities of customized manufacturing to real business value. With C2B transition, DING+ empowers businesses, large or small, with intelligent “On-demand” supply capability, which is critical in leading the next generation global market competition.",
        "foundersTitleCh": "Our Founders",
        "foundersTitleEn": "",
        "foundersPersonName1": "Shuang Sun",
        "foundersPersonPost1": "CEO",
        "foundersPersonExplain1": "Dr. Sun received his PhD from University of Pennsylvania in 2006. He has over 20 years of technical research and development, business consulting experiences. Clients he served include Li-ning, VF, li & fung, Tommy Hilfiger, Timberland  and other the world's top brands.",
        "foundersPersonName2": "Michael Hao",
        "foundersPersonPost2": "执行董事",
        "foundersPersonExplain2": "Michael was an outstanding leader and lead his team to gain the total average annual growth rate for more than 30% within 9 years in SAP. He has more than 20 years experiences in enterprise management software, and has served hundreds of industry leading enterprises in China.",
        "foundersPersonName3": "Leo Liang",
        "foundersPersonPost3": "CMO",
        "foundersPersonExplain3": "Leo was a consulting director of Accenture about retail industry. He has rich resources, market and industry in-depth research on C2B industry. ",
        "foundersPersonName4": "Cindy Yu",
        "foundersPersonPost4": "COO",
        "foundersPersonExplain4": "Dr. Yu is good at enterprise brandind strategy. She has nutured companies to shape corporate culture, remodeled organization structure and coached for 10% of the top 500 Chinese companies.",
        "introduce": "Profile",
        "customersCh": "The best choice for top customers",
        "customersEn": ""
    },
    "join": {
        "bannerTitleCh": "Join us, we need you!",
        "bannerTitleEn": "",
        "hiringNowTitleCh": "Hiring Now",
        "hiringNowTitleEn": "",
        "hiringNowTitle1": "- Why choose us? -",
        "hiringNowExplain1-1": "This is a brand new team",
        "hiringNowExplain1-2": "Dingjust devotes to enable business transformation from traditional B2C model to C2B, which is critical in leading the next generation global market competition.",
        "hiringNowExplain2-1": "Do something meaningful together",
        "hiringNowExplain2-2": "We  provide customers with the best service, and make great efforts to promote global C2B change.We hope that more new partners with the same reason, same values and the common goal to join us!",
        "hiringNowExplain3-1": "Become a better you",
        "hiringNowExplain3-2": "In this team, everyone can give full play to their professional skills as well as learn new knowledge, make progress and become a better person.",
        "hiringNowExplain4-1": "Not bound by age or education",
        "hiringNowExplain4-2": "We only focus on whether you are qualified for the job and the quality results. Get it done!",
        "hiringNowExplain5-1": "Open and friendly working environment",
        "hiringNowExplain5-2": "We firmly reject the so-called office politics. We are willing to create an open and friendly working environment. If you work hard, you will gain something.",
        "hiringNowExplain6-1": "Flexible office mode",
        "hiringNowExplain6-2": "We are not working in a same office. Usually we use WeChat or Dingtalk to commuicate,, but we can work together to complete the task on time.",
        "hiringNowExplain7-1": "Work-life balance",
        "hiringNowExplain7-2": "We will spontaneously organize some activities, such as playing badminton, jogging, KTV and so on to relieve pressure. We also have regular outdoor activities and outward bound training.",
        "hiringNowTitle2": "- what's the test? -",
        "ordealExplain1-1": "Salary is not the first consideration",
        "ordealExplain1-2": "The treatments and benefits provided by Dingjust is really good. We hope this is not the main reason that we attract you, but we share the same value. ",
        "ordealExplain2-1": "Accept regular business trip",
        "ordealExplain2-2": "We have clients all around the world, hope you accept regular business trip we assign.",
        "ordealExplain3-1": "Self-motivated and efficient working attitude",
        "ordealExplain3-2": "You don't have to work from 9 to 5. Refuse dawdling and please keep the Self-motivated and efficient working attitude in mind.",
        "ordealExplain4-1": "Be good at communication and collaboration",
        "ordealExplain4-2": "We are willing to work with partners who know excellent communication, collaboration and cooperation.",
        "ordealExplain5-1": "Be creative and good at learning",
        "ordealExplain5-2": "We are looking forward to working with pragmatic and pioneering spirit people like you.",
        "ordealExplain6-1": "Have positive thinking",
        "ordealExplain6-2": "We welcome all partners who are also full of vitality and passion to join us！",
        "k1Title": "SAP SD/FICO/PP/MM",
        "post": "Job Requirements",
        "recruitmentLink": "Recruitment link",
        "responsibility": "Position statement",
        "k1Explain1": "1、 Be responsible for implementing the implementation of the ICO/ SD/ MM/ PP module in the SAP project independently;",
        "k1Explain2": "2、 Combined with customer requirements analysis, business and process diagnosis, based on SAP to give a feasible solution;",
        "k1Explain3": "3、 All kinds of training and other services for SAP userundefineds needs.",
        "k1Explain4": "1、 College degree or above, SAP implementation experience for more than 3 years;",
        "k1Explain5": "2、 At least 3 years experience in SAP implementation (work experience of external consultant implementing project), able to implement SAP FICO or SD or MM or PP module independently, familiar with background configuration function;",
        "k1Explain6": "3、 In view of the problems put forward by customers, can carry out in-depth analysis, can independently issue the overall solution, according to the core business needs of customers, have a better guiding power;",
        "k1Explain7": "4、 Have a strong sense of responsibility and professionalism, willing to work in a challenging, fast-paced environment; good at communication, kindness, positive and cheerful personality, can quickly integrate into the team, have a good team spirit;",
        "k1Explain8": "5、 Can adapt to long-term travel, Base unlimited.",
        "k2Title": "Sales",
        "k2Explain1": "1、 Responsible for SAP ERP management consulting sales work;",
        "k2Explain2": "2、 Responsible for domestic sales. 。",
        "k2Explain3": "1、 College degree or above, more than 1 year sales experience, majored in computer related;",
        "k2Explain4": "2、 Experience in software sales, ERP related management system is preferred;",
        "k2Explain5": "3、 Strong compressive ability, good communication skills, able to adapt to frequent Business trips;",
        "k2Explain6": "4、 Strong sense of responsibility and professionalism, willing to challenge.",
        "k3Title": "Hybris Software Engineer",
        "k3Explain1": "1、Responsible for the development and implementation of SAP Hybris project;",
        "k3Explain2": "2、Participate in requirements analysis and functional design according to the needs of the project;",
        "k3Explain3": "3、The design, coding, testing, maintenance and system performance optimization of the system are carried out;",
        "k3Explain4": "4、Reporting on problems arising in the process;",
        "k3Explain5": "5、Ensure the implementation of the process and put forward suggestions for improvement.",
        "k3Explain6": "1、Major in computer science, college degree or above;",
        "k3Explain7": "2、Proficient in Java development language;",
        "k3Explain8": "3、Be familiar with Hybris project development;",
        "k3Explain9": "4、At least 3 years working experience in SAP Hybris.",
        "k4Title": "Senior Java Engineer II",
        "k4Explain1": "1、Responsible for transforming functional requirements to technical design;",
        "k4Explain2": "2、Build a basic R & D environment to promote the evolution and development of the architecture; ",
        "k4Explain3": "3、The main technical scheme and the system design are capable of solving a series of technical problems caused by performance, network, distributed and the like;",
        "k4Explain4": "4、To guide and train technical personnel to improve the technical analysis capacity of the team;",
        "k4Explain5": "5、Strengthen programming standards and best practices to optimize production efficiency;",
        "k4Explain6": "6、Introduce innovative technology and innovative solutions for the team, and solve the problem with innovative ideas.",
        "k4Explain7": "1、Working experience in complex business system, high concurrency, high performance web system experience;",
        "k4Explain8": "2、Proficient in Java framework technology such as Spring MVC, experience in SAP Hybris; ",
        "k4Explain9": "3、It can reasonably apply the common deployment and operation and maintenance technology of web system to solve the problems.",
        "k4Explain10": "4、Familiar with mobile application development;",
        "k4Explain11": "5、Familiar with system integration and other technologies;",
        "k4Explain12": "6、Proficient use of development tools such as Git, Jenkins, etc.;",
        "k4Explain13": "7、Familiar with DevOps, familiar with agile development;",
        "k4Explain14": "8、Have the spirit of research and strong ability to analyze and solve problems.",
        "k5Title": "Senior Java Engineer I",
        "k5Explain1": "1、According to the design document, the development of the module can be completed independently.",
        "k5Explain2": "2、According to the requirements, write the test cases of the development module;",
        "k5Explain3": "3、Give feedback on the difficult problems encountered in the development in time, communicate and seek solutions, and complete the development tasks in a planned manner according to the stage;",
        "k5Explain4": "4、Carry on the unit test to the system, cooperate with the tester to carry on the product test and the acceptance work, and audit the test case and so on;",
        "k5Explain5": "5、The design code of the existing system is reviewed, and the existing system is adjusted, optimized and expanded according to the needs of the business department.",
        "k5Explain6": "6、Assist junior to develop.",
        "k5Explain7": "1、Proficiency in java language, in-depth understanding and application of object-oriented models and design patterns;",
        "k5Explain8": "2、Familiar with Spring,Spring MVC,Hibernate and other basic open source framework, understand the development of SOA architecture;",
        "k5Explain9": "3、Familiar with database development, MySQL database development experience, can write high-performance SQL statements;",
        "k5Explain10": "4、Familiar with basic J2EE project management tools, will use SVN,Maven and other management tools;",
        "k5Explain11": "5、Familiar with JSP, Jquery,html5,css and other front-end technology, proficient in the use of ajax json;",
        "k5Explain12": "6、Be familiar with the development of WeChat and other social applications, and be familiar with the docking of the common e-commerce platform;",
        "k5Explain13": "7、Familiar with Junit test framework, able to write test cases;",
        "k5Explain14": "8、A certain data optimization and analysis processing capability;",
        "k5Explain15": "9、Have the desire to solve problems, and have a strong research ability.",
        "k6Title": "Web Front-end Engineer ",
        "k6Explain1": "1、Transform various requirements into reasonable and effective technology realization schemes;",
        "k6Explain2": "2、Be responsible for the customization and availability specification of the front-end template;",
        "k6Explain3": "3、Cooperate with the product designer and visual designer to realize the user experience of the web end;",
        "k6Explain4": "4、Using response design to develop Web/WAP front-end applications on mobile phones, tablets and other platforms;",
        "k6Explain5": "5、Responsible for continuous iteration of the product.",
        "k6Explain6": "1、Familiar with JSP, HTML 5, CSS 3, at least one CSS framework, proficient in page layout, style adjustment preferred; ",
        "k6Explain7": "2、Proficient in Web standards, practical understanding and practical experience of availability, accessibility and other related knowledge;",
        "k6Explain8": "3、Proficient in Jquery,bootstrap,angularJS and other front-end basic libraries, proficient in Javascript object-oriented programming methods;",
        "k6Explain9": "4、Proficient in the development of large-scale Web application, have certain performance optimization and system safety practice;",
        "k6Explain10": "5、At least one non-front-end scripting language (e.g., NodeJS/ Python/ PHP, etc.);",
        "k6Explain11": "6、2D/ 3D rendering experience and technology priority;",
        "k6Explain12": "7、Have a sense of innovation, maintain the love of front-end technology, willing to share;",
        "k6Explain13": "8、Experience in smartphone and tablet development is preferred.",
        "k7Title": "Junior Java Engineer",
        "k7Explain1": "1、College degree or above (including college), relevant working experience is preferred;",
        "k7Explain2": "2、Familiar with Java,JavaScript,Web programming;",
        "k7Explain3": "3、Be familiar with relevant technologies or frameworks such as XML, Struts/ Spring, Spring MVC, JSP, HTML5, etc. (in part);",
        "k7Explain4": "4、Skilled open source community;",
        "k7Explain5": "5、Have a good English foundation;",
        "k7Explain6": "6、Strong documentation ability;",
        "k7Explain7": "7、Have good learning ability;",
        "k7Explain8": "8、Good communication skills and teamwork spirit;",
        "k7Explain9": "9、More than one year development experience is preferred; excellent college students can also consider internships.",
        "recruit": "Recruitment"
    },
    "product": {
        "productsServices": "<span style='letter-spacing:0'>Products & Services</span>",
        "productsServicesEn": "",
        "c2bChText": "",
        "c2bExplain1": "Easy Personalized Customization",
        "c2bExplain2": "Friendly Design Procedure",
        "c2bExplain3": "Digitalized Body Measuring",
        "c2bExplain4": "Efficient Production Circle",
        "b2bChText": "",
        "b2bExplain1": "Quick resources integration, Transparent benefit sharing",
        "b2bExplain2": "Reusable Resources for brand-owners, such as productivity, materials and designs",
        "b2bExplain3": "Complimentary orders to balance production in off-season",
        "b2bExplain4": "Wider range of options of high quality fabric for designers",
        "b2bExplain5": "Investment guidance driven by market data for fabric merchant to join smartly and efficiently",
        "c2mChText": "",
        "c2mExplain1": "IPS system: to schedule intelligently and arrange flexibly",
        "c2mExplain2": "MSE system: to prearrange the best route and prevent malfunction",
        "c2mExplain3": "MCS system: to control intelligently and to operate and test sectionally",
        "c2mExplain4": "Visible Management: to realize transparent management and real-time monitoring",
        "CABAChText": "",
        "CABAExplain1": "Independent from operation system",
        "CABAExplain2": "Compatible with operation system through adaptation and integration",
        "CABAExplain3": "Reliable easy and repetitive work",
        "CABAExplain4": "Capable of big data analysis and complex computing",
        "CABAExplain5": "Flexible and interchangable between AI mode and Manual mode"
    },
    "successfulCase": {
        "common": {
            "bannerTitleCh1": "选择我们值得信赖！",
            "bannerTitleEn1": "We are your best choice!",
            "bannerTitleCh2": "开创大规模个性化智能制造",
            "bannerTitleCh3-1": "可视化，智能化，无人化",
            "bannerTitleCh3-2": "数字工厂",
            "btText": "查看详情"
        },
        "bxn": {
            "title1": "Customized in 7 Days, innovating large-scale personalized intelligent manufacturing",
            "explain1": "SAINT ANGELO was founded in 1996 and known as a garment-oriented company with diversified portfolios. We now have over 10 thousands employers for our business. Total assets of over 7 billion yuan and overall retail income over 5 billion US dollar has crowned us as one of top 100 Chinese enterprises in regards of profit and taxation for 17 consecutive years. With the fame of one of biggest enterprise in garment industry, we are now deploying Industry 4.0 strategy as well as making our high-profile entrance into online custom-tailor service market.",
            "title2-1": "SAINT ANGELO Personalized Customization Service, Service Procedure",
            "title2-2": "",
            "explain2": "We extended our offline competitive advantages to online platform where customers could see the design and component of the product in a standard and detailed view. In terms of personalized customization service, we collect body measurement by obtaining standard size number or from in-store visit or on-site appointment. We have our service ranges from formal and special outfit to casual and festive as well as from western style to traditional Chinese style.It is friendly to select and match on the platform and convenient enough to order and pay online. Improving is the garment grading with measurements collected from platform since 2014, the start of intelligent industry 4.0 manufacturing. Now the completion of phase 1 of the first intelligent production line enhances the whole productivity, which is promising to grow more.",
            "title3-1": "The Advantages and Major Contribution of SAINT ANGELO in",
            "title3-2": "Personalized Customization Business ",
            "explain3-1": "SAINT ANGELO plans to open up 5000 offline channels till the end of 2018 as well as to boost suit production scale up to 1200 thousand of which 600 thousand will be of custom-made. The sales forecast of online and offline retail would be 10 billion yuan and the profit expects to sum up to 1 billion yuan.The above figures highlight the advantages of SAINT ANGELO in personalized customization market, such as good brand popularity, national physical marketing network and rich personal customization service experience.Additionally, as a listed enterprise, SAINT ANGELO also has its strength in the capital market. For example, we has deployed O2O strategy along with Industry 4.0 trend and we has introduced SAP solutions to background, foreground and central management systems. We are flexible and scalable for development in the future.",
            "explain3-2": "To win the market, SAINT ANGELO made its contribution in widening the channel,",
            "explain3-3": "reconstructing the production line and significantly increasing the proportion of personalized customization in business. It is worth mentioning that in July 2016 we were rewarded the pilot demonstration enterprise of smart manufacturing by the Ministry of Industry and Information Technology and we are one of two enterprises enjoying that reputation nationally in apparel industry while one and only as brand-owner. ",
            "explain3-4": "The cloud-wing platform has shortened the delivery time to 7 working days and facilitated large -scale personalized customization and realized made-to-order production pattern. The success of the project increases annual output of personal customized suits to over 250 thousand and perfectly achieves the ultimate goal that “sewing without lowering the quality of customization and one-piece flow does not reduce efficiency”.It realizes zero-pressure stock model for personalized customization business."
        },
        "1wor": {
            "title1": "助力系统升级，以数字化，智能化，透明化为目标",
            "explanin1": "解决了传统精益产线所出现的计划插单难、现场人工派工、换款换单繁琐、进度统计不及时等方面的问题。可以实现大单、小单、定制订单混合柔性生产，提高生产效率，实现定制下单后一小时内交货，不影响大货生产。",
            "title2": "智能制造云平台",
            "explanin2-1": "传统精益生产在工艺编排，任务分派，物流运输，人员调配，品质管理，工位布局等环节都严重依赖班组长的生产管理经验。旧工厂采用的传统精益生产模式，存在工位工序规划产线与工艺路线生产不灵活，无法实现大单，小单，定制订单混合柔性生产，容易产生生产瓶颈等问题。",
            "explanin2-2": "定制加（DING+）助力系统升级，以数字化、智能化、透明化为目标，结合优化现场布局。最终达成无纸化办公，大单、小单、定制订单的混合柔性智能化生产。在实现自动化、智能化上，有以下6个方面得到优化。",
            "title3-1": "实现自动化与智能化",
            "title3-2": "在实现自动化、智能化上，有以下6个方面得到优化。",
            "explanin3-titile1": "排程自动化",
            "explanin3-explanin1": "通过使用IPS对接ERP，实现了订单的自动化排程。可以根据工厂产能、员工技能、学习曲率、工作日历、订单优先级等对订单进行自动化排程。",
            "explanin3-titile2": "技术资料自动化",
            "explanin3-explanin2": "智能整合PLM、GST、CAD等文件， 实现了自动生成BOM与工艺以及自动排版。",
            "explanin3-titile3": "派工自动化",
            "explanin3-explanin3": "使用MES系统，根据工艺、设备、工人、技能、WIP等实现自动化派工。",
            "explanin3-titile4": "物流自动化",
            "explanin3-explanin4": "通过MCS与智能吊挂,AGV等硬件设备结合，可以实现生产全程物料自动化传输，并可以在后端实现成品物流自动化",
            "explanin3-titile5": "管理可视化",
            "explanin3-explanin5": "可视化看板驱动整个生产业务流程，实现生产的全程可视化。",
            "explanin3-titile6": "生产智能化",
            "explanin3-explanin6": "整合3D量体机、智能裁床机、实样切割机等智能制造机器实现智能生产。",
            "title4-1": "系统功能亮点介绍",
            "title4-2": "最终达成无纸化办公，大单、小单、定制订单的混合柔性智能化生产",
            "explanin4-title1": "IPS",
            "explanin4-explanin1-1": "支持遗传算法等智能算法，匹配法、排序法等传统算法",
            "explanin4-explanin1-2": "支持插单排程、通过鼠标拖拽排程、预排程、自动和手工排程；",
            "explanin4-explanin1-3": "自动对接ERP和POS。",
            "explanin4-title2": "MCS",
            "explanin4-explanin2-1": "根据运输里程，运输所需要的时间，吊挂线、衣架与工位的状态以及吊挂线的运输负荷率智能化规划路线，不出现拥塞与生产瓶颈。",
            "explanin4-title3": "吊挂线",
            "explanin4-explanin3-1": "可以根据指令将物料选择合适的路线运输到目的地；",
            "explanin4-explanin3-2": "通电、插入网线就可以使用。不需要专用的控制电脑。",
            "explanin4-title4": "PAD",
            "explanin4-explanin4-1": "拥有实时作业指导书、能把控品质标准，支持包括返工在内的全方位品质管控，身份识别和交接班管理。",
            "explanin4-title5": "MES",
            "explanin4-explanin5-1": "整合GST、CAD、裁床、实样切割机；",
            "explanin4-explanin5-2": "可以根据部件、颜色、款式、尺码等自动配料；",
            "explanin4-explanin5-3": "根据机器、人员、技能以及工位的WIP等综合派工；",
            "explanin4-explanin5-4": "支持工序间插单，包括领料，裁剪，上裁片，缝制等生产阶段；",
            "explanin4-explanin5-5": "支持数据采集、数据统计、生产追溯；",
            "explanin4-explanin5-6": "可同时生产大货，小单，及定制订单；",
            "explanin4-explanin5-7": "可以通过PAD进行品质管控，实现生产返工。",
            "explanin4-title6": "可视化",
            "explanin4-explanin6-1": "通过看板驱动生产的所有关键工作，如领料、裁剪、缝制等都通过看板来驱动，有效杜绝生产错误，提高生产效率； ",
            "explanin4-explanin6-2": "通过看板驱动生产的所有关键工作，如领料、裁剪、缝制等都通过看板来驱动，有效杜绝生产错误，提高生产效率；"
        }
    }
}